name: "Arch_Baseline"
layer {
  name: "Input"
  type: "HDF5Data"
  top: "data"
  top: "label"
  hdf5_data_param {
    source: "caffe/dataset/train_data_list.txt"
    batch_size: 128
    shuffle: true
  }
}
layer {
  name: "ip"
  type: "InnerProduct"
  bottom: "data"
  top: "ip"
  inner_product_param {
    num_output: 500
  }
}
layer {
  name: "loss"
  type: "EuclideanLoss"
  bottom: "ip"
  bottom: "label"
  top: "loss"
}
